//Завдання 4 варіант 13
//Обчислити значення функції
//Скласти структурну схему алгоритму та програму обчислення значень функції y = F(x) відповідно до завдань, зазначених у таблиці.
//Примітка.Значення першого з двох параметрів, які наведені в таблиці, задати як константу, значення другого ввести з клавіатури.


#include <iostream>
using namespace std;


int main()
{
    double a, b, x, y, t;
    t = 2.2;
    cout << "b=";
    cin >> b;

    a = pow(t, 2) * b;

    x = pow(a - b, 1.0/3.0);
 
    y = a * cos(x) - b * sin(x);
    cout << "y= " << y << endl;

    system("pause>>void");
    return 0;
}
