//Завдання 3 варіант 13
// Значення виразу
//Написати програму, яка обчислює вирази за двома формулами.
//Попередньо підготуйте тестові приклади для другої формули з допомогою калькулятора
//(результати обчислення за двома формулами мають співпадати).


#include <iostream>
using namespace std;


int main()
{
    double a, b, z1, z2;
    cout << "a = ";
    cin >> a;
    cout << "b = ";
    cin >> b;
    z1 = (sin(a) + cos(2 * b - a)) / (cos(a) - sin(2 * b - a));
    z2 = (1 + sin(2 * b)) / (cos(2 * b));
    cout << "z1 = " << z1 << "\t z2 = " << z2 << endl;
    system("pause>>void");
    return 0;
}